#include <iostream>

/*
 * Да се напише функция на C++, която приема като параметър едномерен масив от дробни числа и връща като резултат
 * сумата на елементите му с нечетни индекси. Функцията да не извиква други функции. Да се напише програма,
 * която извиква написаната функция върху три масива от дробни числа (с едно число, с три числа и един избран от вас)
 * и извежда на екрана резултатите за всеки от тях
 */

double get_sum_odd_indexes(double array[], size_t size)
{
    double result = 0;

    for(int i = 1; i < size; i += 2) //0 е четен индекс, 1, 3, 5, т.н. са нечетни
    {
        result += array[i];
    }
    return result;
}
int main() {

    double a[1] = {3.14}; //0
    double b[3] = {3.754, 5.12, 6.321}; //5.12
    double c[5] = {1.3332, 2.01, 5.98, 1.312, 91.23}; //2.01 + 1.312 = 3.322

    std::cout << get_sum_odd_indexes(a, 1) << std::endl;
    return 0;
}
